# Data merge

In [11]:
import pandas as pd

# Example dataset for data merging 
# dataset 1: pakistani indivdualsd 
data1 = {
'id':[1,2,3],
'name':['Ahmed','Fatima','Ali'],
'age':[23,24,25]}

df1= pd.DataFrame(data1)
df1.head()
                

# # dataset 2: pakistani indivdualsd

   id    name  age
0   1   Ahmed   23
1   2  Fatima   24
2   3     Ali   25

In [16]:
data2 = {
'id':[1,2,3],
'city':['Karachi','Lahore','Islamabad'],
'occupation':['Engineer','Doctor','Teacher']}

df2= pd.DataFrame(data2)
df2.head()

   id       city occupation
0   1    Karachi   Engineer
1   2     Lahore     Doctor
2   3  Islamabad    Teacher

In [17]:
merge_df = pd.merge(df1,df2, on='id', how='inner')
merge_df

   id    name  age       city occupation
0   1   Ahmed   23    Karachi   Engineer
1   2  Fatima   24     Lahore     Doctor
2   3     Ali   25  Islamabad    Teacher


---
# **Concatenation**

In [28]:
# Example dataset for pakistani context 
# Dataset 1 - pakistani name and ages 
data1 = {
    'Name':['Ahmed','Fatima','Ali'],'Age':['28','30','26']
}
data2 ={
    'Name':['Sara','Usman','Alisha'],'Age':['29','31','27']
}
data3  = {
    'City':['Karachi','Lahore','Islamabad'],'Provice':['SIndh','Panjab','Islamabad']
}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
df3 = pd.DataFrame(data3)

# concatenated row 
concatenated_row = pd.concat([df1,df2],axis=0)
print(";;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;")
print(concatenated_row)

# concatenated column
# Note : For a meaningful cokumn-wise concatenation . dataFrame 
concatenated_column = pd.concat([df1,df3],axis=1)
print(";;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;")
print(concatenated_column)

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
     Name Age
0   Ahmed  28
1  Fatima  30
2     Ali  26
0    Sara  29
1   Usman  31
2  Alisha  27
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
     Name Age       City    Provice
0   Ahmed  28    Karachi      SIndh
1  Fatima  30     Lahore     Panjab
2     Ali  26  Islamabad  Islamabad